use SportSchoolVer4DB

insert into Persons
values('Беседников', 'Владимир', 'Владимирович', '22/05/1975', '30/06/2014', 'СШОРТ', '+79510511251', 'рп Луховка', 'annabes@yandex.ru', NULL, 'старший тренер, тренер сборной РМ'),
		('Беседников', 'Олег', 'Владимирович', '20/01/1975', '30/06/2014', 'СШОРТ', '+79510511251', 'рп Луховка', 'annabes@yandex.ru', NULL, 'тренер сборной РМ'),
		('Беседников', 'Сергей', 'Владимирович', '05/03/2004', '30/06/2014', 'ИПК, 4 курс', '+79510511251', 'рп Луховка', 'annabes@yandex.ru', NULL, 'спортсмен-инструктор, член сборной РМ'),
		('Скрябина', 'Маргарита', 'Вадимовна', '05/03/2003', '30/06/2021', NULL, NULL, NULL, NULL, NULL, 'инструктор'),
		('Ивенин', 'Денис', 'Владимирович', '05/03/2006', '01.12.2010', 'ИПК, 1 курс', NULL, '', NULL, NULL, 'член сборной РМ'),
		('Гарцева', 'Ева', 'Игоревна', '05/03/2003', '01.07.2022', NULL, NULL, NULL, NULL, NULL, NULL),
		('Бинда', 'Александр', '-', '05/03/2001', '25.01.2021', NULL, NULL, NULL, NULL, NULL, NULL),
		('Богданов', 'Марк', 'Андреевич', '05/03/2000', '04.07.2018', NULL, NULL, NULL, NULL, NULL, NULL),
		('Евлоев', 'Тамерлан', 'Якубович', '05/03/2000', '04.07.2018', NULL, NULL, NULL, NULL, NULL, NULL),
		('Мягков', 'Дмитрий', 'Дмитриевич', '05/03/1999', '01.08.2017', NULL, NULL, NULL, NULL, NULL, NULL),
		('Сумарокова', 'Милена', 'Андреевна', '05/03/2002', '01.11.2017', NULL, NULL, NULL, NULL, NULL, NULL),
		('Бинда', 'Джорджо', '-', '05/03/2005', '01.11.2010', 'ИПК, 3 курс', NULL, NULL, NULL, NULL, NULL),
		('Иванов', 'Савелий', 'Владимирович', '05/03/2004', '01.02.2019', NULL, NULL, NULL, NULL, NULL, NULL),
		('Лазутенков', 'Дмитрий', 'Сергеевич', '05/03/2009', '01.09.2016', NULL, NULL, NULL, NULL, NULL, NULL),
		('Паршина', 'Дарья', 'Олеговна', '05/03/2007', '30.09.2013', NULL, NULL, NULL, NULL, NULL, NULL),
		('Афонькина', 'Виктория', 'Артуровна', '05/03/2012', '01.10.2020', NULL, NULL, NULL, NULL, NULL, NULL),
		('Кильдяйкин', 'Даниил', 'Игоревич', '05/03/2011', '13.01.2020', NULL, NULL, NULL, NULL, NULL, NULL),
		('Абаев', 'Роман', 'Сергеевич', '05/03/2013', '01.10.2020', NULL, NULL, NULL, NULL, NULL, 'м: Елена Петровна, библиотекарь, тел.4-16-46; п:Николай Семенович, токарь, тел. 2-01-15'),
		('Венчакова', 'Виктория', 'Дмитриевна', '05/03/2013', '01.10.2020', NULL, NULL, NULL, NULL, NULL, NULL),
		('Асадулин', 'Иван', 'Ильич', '05/03/2013', '01.10.2020', NULL, NULL, NULL, NULL, NULL, NULL),
		('Бекшаев', 'Максим', 'Денисович', '05/03/2014', '01.09.2021', NULL, NULL, NULL, NULL, NULL, NULL),
		('Иванова', 'Анна', 'Сергеевна', '05/03/2014', '01.09.2021', NULL, NULL, NULL, NULL, NULL, NULL)

insert into Sport
values('Теннис'),
		('Легкая атлетика'),
		('Конный спорт'),
		('Настольный теннис'),
		('Плавание'),
		('Шахматы')

insert into SportCategories
values('I', 2),
		('II', 2),
		('III', 2),
		('Iю', 2),
		('IIю', 2),
		('IIIю', 2),
		('КМС', 3),
		('МС', 100),
		('МСМК', 100)

insert into Departments
values('Отделение тенниса', 1, 1, NULL),
		('Отделение легкой атлетики', 2, 3, NULL),
		('Отделение конного спорта', 3, NULL, NULL),
		('Отделение плавания', 5, NULL, NULL)

insert into Stages
values('Этап начальной подготовки'),
		('Тренировочный этап'),
		('Этап совершенствования спортивного мастерства'),
		('Этап высшего спортивного мастерства')

insert into Groups
values('ВСМ-1', 1, 1, 4),
		('ССМ-1', 1, 1, 3),
		('ССМ-4', 1, 1, 3),
		('Т1-1', 1, 2, 2),
		('НП1-1', 1, 2, 1),
		('НП1-2', 1, 2, 1),
		('НП1-1', 2, 3, 1),
		('НП1-2', 2, 3, 1),
		('НП1-1', 4, 3, 4),
		('НП1-1', 3, 4, 4)

insert into SportsmensGroup
values(7, 1),
		(8, 1),
		(9, 1),
		(10, 1),
		(11, 1),
		(3, 2),
		(12, 2),
		(13, 2),
		(6, 3),
		(5, 3),
		(14, 4),
		(15, 4),
		(16, 5),
		(17, 5),
		(18, 6),
		(19, 6),
		(16, 7),
		(18, 7),
		(15, 8),
		(17, 8),
		(21, 9),
		(2, 10),
		(3, 10),
		(20, NULL),
		(22, NULL)

insert into SportsmensSportCat
values(2, 1, 8, '26/06/2015'),
		(3, 1, 7, '01/08/2022'),
		(4, 1, 8, '01/08/2018'),
		(5, 1, 7, '01/08/2022'),
		(6, 1, 7, '01/08/2022'),
		(7, 1, 8, '01/08/2022'),
		(8, 1, 8, '01/08/2022'),
		(9, 1, 8, '01/08/2022'),
		(10, 1, 8, '01/08/2022'),
		(11, 1, 8, '01/08/2022'),
		(12, 1, 7, '01/08/2022'),
		(13, 1, 7, '01/08/2022'),
		(14, 1, 6, '01/08/2022'),
		(15, 1, 4, '01/08/2022'),
		(3, 6, 5, '01/08/2012')

insert into Trainers
values(1, 'BesedVV', 'bvV75', 1),
		(2, 'BesedOV', 'boV99', 0),
		(3, 'BesedSV', 'bsV04', 0),
		(4, 'ScryabMV', 'smV98', 0)